	#include<iostream>
	#include"print.h"
	#include"function.h"
	#include"employee.h"
	using namespace std;

	void printFunction() {
		cout << "                                **********************************************************\n";
		cout << "                                *                     1.匹配数据                         *\n";
		cout << "                                *               2.按照实发工资排序输出                   *\n";
		cout << "                                *                  3.增加新的员工                        *\n";
		cout << "                                *                    4.查询数据                          *\n";
		cout << "                                *                    5.修改记录                          *\n";
		cout << "                                *                    6.删除记录                          *\n";
		cout << "                                *                7.显示全部职工信息                      *\n";
		cout << "                                *                    8.退出程序                          *\n";
		cout << "                                **********************************************************\n";
		cout << "\n\n                                                 你要选择的功能是：";
	}

	void printFunction1() {
		cout << "                                **********************************************************\n";
		cout << "                                *                                                        *\n";
		cout << "                                *                     选择数据统计                       *\n";
		cout << "                                *                                                        *\n";
		cout << "                                *                     1.工资总额                         *\n";
		cout << "                                *                     2.工资平均值                       *\n";
		cout << "                                *                                                        *\n";
		cout << "                                **********************************************************\n";
		cout << "\n\n                                                   你选择的统计数据为：";
	}

	void printFunction1(listpoint1 *head, int i) {
		printWages(head, i);
	}

	void printFunction1(listpoint2 *head, int i) {
		printWages(head, i);
	}

	void printFunction2(listpoint1 *head1, listpoint2 *head2) {
	
		listpoint1 *temp1 = head1;
		listpoint2 *temp2 = head2;

		cout << "                                **********************************************************\n\n";
		cout << "                                                  按照工资排序输出为                      \n\n";
		cout << "                                                       正式员工                           \n\n";
		printEmployee(head1);
		cout << "\n\n";
		cout << "                                                       临时员工                           \n\n";
		printEmployee(head2);
		cout << "\n\n";
		cout << "                                **********************************************************\n";

	}

	void printFunction3() {
		cout << "                                **********************************************************\n";
		cout << "                                *                                                        *\n";
		cout << "                                *                 选择你要增加的新员工类型               *\n";
		cout << "                                *                                                        *\n";
		cout << "                                *             （1）正式员工   （2）临时员工              *\n";
		cout << "                                *                                                        *\n";
		cout << "                                **********************************************************\n";
		cout << "\n\n                                                      你的选择是：";
	}

	void printFunction4() {
		cout << "                                **********************************************************\n";
		cout << "                                *                                                        *\n";
		cout << "                                *                 选择你要操作的员工类型                 *\n";
		cout << "                                *                                                        *\n";
		cout << "                                *             （1）正式员工   （2）临时员工              *\n";
		cout << "                                *                                                        *\n";
		cout << "                                **********************************************************\n";
		cout << "\n\n                                                      你的选择是：";
	}

	void printFunction4(string s) {
		cout << "                                **********************************************************\n";
		cout << "                                *                                                        *\n";
		cout << "                                *                     选择查询方式                       *\n";
		cout << "                                *                                                        *\n";
		cout << "                                *                     1.按编号查询                       *\n";
		cout << "                                *                     2.按姓名查询                       *\n";
		cout << "                                *                     3.按工资查询                       *\n";
		cout << "                                *                                                        *\n";
		cout << "                                **********************************************************\n";
		cout << "\n\n                                                   你选择的查询方式为：";
	}

	void printFunction5(listpoint1 *head) {
		cout << "                                **********************************************************\n";
		cout << "                                *                                                        *\n";
		cout << "                                *                     选择更改信息                       *\n";
		cout << "                                *                                                        *\n";
		cout << "                                *                     1.修改编号                         *\n";
		cout << "                                *                     2.修改姓名                         *\n";
		cout << "                                *                     3.修改性别                         *\n";
		cout << "                                *                     4.修改年龄                         *\n";
		cout << "                                *                     5.修改家庭住址                     *\n";
		cout << "                                *                     6.修改基本职务工资                 *\n";
		cout << "                                *                     7.修改岗位津贴                     *\n";
		cout << "                                *                     8.修改养老金                       *\n";
		cout << "                                *                     9.修改住房公积金                   *\n";
		cout << "                                *                     10.修改所得税                      *\n";
		cout << "                                *                     11.修改医疗保险                    *\n";
		cout << "                                *                                                        *\n";
		cout << "                                **********************************************************\n";
		cout << "\n\n                                                   你选择的修改信息为：";
	}

	void printFunction5(listpoint2 *head) {
		cout << "                                **********************************************************\n";
		cout << "                                *                                                        *\n";
		cout << "                                *                     选择更改信息                       *\n";
		cout << "                                *                                                        *\n";
		cout << "                                *                     1.修改编号                         *\n";
		cout << "                                *                     2.修改姓名                         *\n";
		cout << "                                *                     3.修改性别                         *\n";
		cout << "                                *                     4.修改年龄                         *\n";
		cout << "                                *                     5.修改家庭住址                     *\n";
		cout << "                                *                     6.修改基本职务工资                 *\n";
		cout << "                                *                     7.修改奖金                         *\n";
		cout << "                                *                     8.修改所得税                       *\n";
		cout << "                                *                                                        *\n";
		cout << "                                **********************************************************\n";
		cout << "\n\n                                                   你选择的修改信息为：";

	}

	void printFunction6() {
		cout << "                                **********************************************************\n";
		cout << "                                *                                                        *\n";
		cout << "                                *                     选择你要删除的方式                 *\n";
		cout << "                                *                                                        *\n";
		cout << "                                *                 (1)逻辑删除  （2）物理删除             *\n";
		cout << "                                *                                                        *\n";
		cout << "                                *                       （3）恢复逻辑删除                *\n";
		cout << "                                *                                                        *\n";
		cout << "                                **********************************************************\n";
		cout << "                                                     你选择的方式是：";
	}